tap "buo/cask-upgrade"
tap "candid82/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "libsql/sqld"
tap "oven-sh/bun"
tap "tursodatabase/tap"
tap "yqrashawn/goku"
brew "atuin"
brew "python@3.12"
brew "libavif"
brew "php"
brew "composer"
brew "node"
brew "neofetch"
brew "dockutil"
brew "elixir"
brew "exiftool"
brew "pango"
brew "tesseract"
brew "tmuxinator"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "gh"
brew "gifski"
brew "git"
brew "gnupg"
brew "go"
brew "himalaya"
brew "llvm@17"
brew "mas"
brew "neovim"
brew "pytorch"
brew "openai-whisper"
brew "pandoc"
brew "python@3.11"
brew "rcm"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "tldr"
brew "tmux"
brew "whisper-cpp"
brew "yt-dlp"
brew "zoxide"
brew "jesseduffield/lazygit/lazygit"
brew "oven-sh/bun/bun"
brew "yqrashawn/goku/goku"
# now that i've given up on separating work and personal machines, favor MAS version of apps. easier to update
cask "1password" unless [ $MACHINE == "work" ]
cask "1password-cli"
cask "arc"
cask "cleanshot" unless [ $MACHINE == "work" ]
cask "font-input"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-poppins"
cask "font-rubik"
cask "font-rubik-one"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "imageoptim"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "keycastr"
cask "mysides"
cask "obsidian"
cask "raycast"
cask "recut"
cask "rode-central"
cask "slack"
cask "swiftdefaultappsprefpane"
cask "zoom"
mas "1Blocker", id: 1365531024 unless [ $MACHINE == "work" ]
mas "1Password for Safari", id: 1569813296 unless [ $MACHINE == "work" ]
mas "Affinity Designer 2", id: 1616831348 unless [ $MACHINE == "work" ]
mas "Affinity Photo 2", id: 1616822987 unless [ $MACHINE == "work" ]
mas "Affinity Publisher 2", id: 1606941598 unless [ $MACHINE == "work" ]
mas "Hidden Bar", id: 1452453066 unless [ $MACHINE == "work" ]
mas "Keynote", id: 409183694 unless [ $MACHINE == "work" ]
mas "Klack", id: 6446206067 unless [ $MACHINE == "work" ]
mas "Magnet", id: 441258766 unless [ $MACHINE == "work" ]
mas "Screens 5", id: 1663047912 unless [ $MACHINE == "work" ]
